package test;

public class CommonTest extends BaseTest {

    //Даннный класс создан для демонстрации работы с базовым классом тестов

    // В конструкторе вызывается конструктор базового класса
    public CommonTest() {

        // Передайте имя теста и количество наборов
        super("Common", 1);
    }

    @Override
    public void Test() {
        /*
            Здесь вы проводите само тестирование, создаете обьекты и вызываете методы.
            Далее вы начинаете проверять результат.
            Вызовете AddResult(_); и добавьте внутрь сообщение об ошибке, возникшей в тесте.
        */

        boolean result = true;
        if (!result)
            AddResult("Test failed on __ " + result);

        // В конце вызовете базовый метод Test() для вывода результатов и очистки данных.
        super.Test();
    }
}
